# Using Select Dtypes

<span>Once you get used to using pandas, filtering dataframe for content quickly and efficiently can be a huge asset. Pandas introduced a new feature ".select_dtypes" function that allows you to filter dataframe quickly by dtype values. You can really get create and use this function to operate over you dataframe in more flexible ways, with this code. Check out some of the examples below.</span>

### Import Preliminaies

In [18]:
# Import modules
import pandas as pd

# Import video games data
df = pd.read_csv('Data/Video Games Sales/vgsales.csv')

# View the schema of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
Rank            16598 non-null int64
Name            16598 non-null object
Platform        16598 non-null object
Year            16327 non-null float64
Genre           16598 non-null object
Publisher       16540 non-null object
NA_Sales        16598 non-null float64
EU_Sales        16598 non-null float64
JP_Sales        16598 non-null float64
Other_Sales     16598 non-null float64
Global_Sales    16598 non-null float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [19]:
# View the dataframe
df.head(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

### Using the Select DTypes Function

In [20]:
# Select the object features in your dataframe
df.select_dtypes(include=['object']).head(5)

                       Name Platform         Genre Publisher
0                Wii Sports      Wii        Sports  Nintendo
1         Super Mario Bros.      NES      Platform  Nintendo
2            Mario Kart Wii      Wii        Racing  Nintendo
3         Wii Sports Resort      Wii        Sports  Nintendo
4  Pokemon Red/Pokemon Blue       GB  Role-Playing  Nintendo

In [21]:
# Select all the non features that are not object or int features in the
# dataframe
df.select_dtypes(exclude=['object','int']).head(5)

     Year  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0  2006.0     41.49     29.02      3.77         8.46         82.74
1  1985.0     29.08      3.58      6.81         0.77         40.24
2  2008.0     15.85     12.88      3.79         3.31         35.82
3  2009.0     15.75     11.01      3.28         2.96         33.00
4  1996.0     11.27      8.89     10.22         1.00         31.37

In [22]:
# View all the non float feature in the dataframe
df.select_dtypes(exclude=['float']).head(5)

   Rank                      Name Platform         Genre Publisher
0     1                Wii Sports      Wii        Sports  Nintendo
1     2         Super Mario Bros.      NES      Platform  Nintendo
2     3            Mario Kart Wii      Wii        Racing  Nintendo
3     4         Wii Sports Resort      Wii        Sports  Nintendo
4     5  Pokemon Red/Pokemon Blue       GB  Role-Playing  Nintendo

### Use Case: Describing Only Numeric Features

In [23]:
# Filtering for flaot and int feature before viewing the data's summary stastics
df.select_dtypes(include=['float','int']).describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

### Use Case: Encoding Objects Values

In [24]:
# View on the object features
df.select_dtypes(include=['object']).head(5)

                       Name Platform         Genre Publisher
0                Wii Sports      Wii        Sports  Nintendo
1         Super Mario Bros.      NES      Platform  Nintendo
2            Mario Kart Wii      Wii        Racing  Nintendo
3         Wii Sports Resort      Wii        Sports  Nintendo
4  Pokemon Red/Pokemon Blue       GB  Role-Playing  Nintendo

In [26]:
# Encoding all the object features in our dataframe
encoded_feature = df.select_dtypes(include=['object']).columns

# Label encode categorical features
for col in df.select_dtypes(include=['object']):
    df[col] = df[col].astype('category').cat.codes

# View dataframe head
df[encoded_feature].head(5)

    Name  Platform  Genre  Publisher
0  11007        26     10        359
1   9327        11      4        359
2   5573        26      6        359
3  11009        26     10        359
4   7346         5      7        359

In [27]:
# View the Schema of the dataframe again
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
Rank            16598 non-null int64
Name            16598 non-null int16
Platform        16598 non-null int8
Year            16327 non-null float64
Genre           16598 non-null int8
Publisher       16598 non-null int16
NA_Sales        16598 non-null float64
EU_Sales        16598 non-null float64
JP_Sales        16598 non-null float64
Other_Sales     16598 non-null float64
Global_Sales    16598 non-null float64
dtypes: float64(6), int16(2), int64(1), int8(2)
memory usage: 1005.0 KB

Author: Kavi Sekhon